; ModuleID = 'i14_window_split_768_to_512_256.ll'
source_filename = "/home/synthara/VersalPrjs/LDRD/rtda_demo/aieml7/window_split_768_to_512_256.cpp"
target datalayout = "e-i8:8:8-i16:16:16-i32:32:32-i64:32:32-f32:32:32-f64:32:32-p:32:32:32:32:8-s0:256:256-a0:8:8-S256-n32:64-P1-p0:20:32:32:32:8-p1:20:32:32:32:8-p2:20:32:32:32:8-p3:20:32:32:32:8-p4:20:32:32:32:8-p5:20:32:32:32:8-p6:20:32:32:32:8-p7:20:32:32:32:8-p8:20:32:32:32:8-p9:20:32:32:32:8-p10:20:32:32:32:8-p11:20:32:32:32:8-p12:20:32:32:32:8-p13:20:32:32:32:8-p14:20:32:32:32:8-p15:20:32:32:32:8"
target triple = "pdarch-unknown-unknown-elf"

%struct.output_window = type { i32, i32, ptr, ptr, [2 x ptr], ptr, [2 x ptr], i32, i32, [2 x i32] }
%struct.input_window = type { i32, i32, ptr, ptr, [2 x ptr], ptr, [2 x ptr], i32, i32, [2 x i32] }
%struct.ipd.custom_type.addr_t.addr_t = type { i20 }
%struct.chessout___Pvoid_add_3d_byte_int___Pvoid___sint___sint___sint_addr_t_addr_t_addr_t_addr_t_addr_t_addr_t = type { ptr, %struct.ipd.custom_type.addr_t.addr_t, %struct.ipd.custom_type.addr_t.addr_t }

$_Z10cyclic_addPaiS_j = comdat any

$_ZN6addr_tC2Ei = comdat any

$_Z11add_3d_byteIaEPT_S1_iiR6addr_tiiS3_i = comdat any

$_Z15add_3d_byte_intIa6addr_tS0_EN13chessEnableIfIXaasr17chessIsCompatibleIN15chessRemoveQualIT0_E4typeES0_EE5valuesr17chessIsCompatibleINS2_IT1_E4typeES0_EE5valueEPT_E4typeESA_iiiS0_S0_RS3_S0_S0_RS6_ = comdat any

; Function Attrs: mustprogress noinline nounwind

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 16.0.3 (/u/sgasip/ipd/repositories/llvm_ipd 6a0b186d7c0e25173296a8e19f630e71bd7e8ed9)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, imports: !97, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/synthara/VersalPrjs/LDRD/rtda_demo/aieml7/window_split_768_to_512_256.cpp", directory: "/home/synthara/VersalPrjs/LDRD/rtda_demo/aieml7/Work/aie/ir")
!2 = !{!3, !19}
!3 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "aie_dm_resource", file: !4, line: 177, baseType: !5, size: 32, flags: DIFlagEnumClass, elements: !6, identifier: "_ZTS15aie_dm_resource")
!4 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/data/aie_ml/lib/me_defines.h", directory: "")
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "none", value: 0)
!8 = !DIEnumerator(name: "a", value: 1)
!9 = !DIEnumerator(name: "b", value: 2)
!10 = !DIEnumerator(name: "c", value: 3)
!11 = !DIEnumerator(name: "d", value: 4)
!12 = !DIEnumerator(name: "stack", value: 5)
!13 = !DIEnumerator(name: "ab", value: 6)
!14 = !DIEnumerator(name: "ac", value: 7)
!15 = !DIEnumerator(name: "ad", value: 8)
!16 = !DIEnumerator(name: "bc", value: 9)
!17 = !DIEnumerator(name: "bd", value: 10)
!18 = !DIEnumerator(name: "cd", value: 11)
!19 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "chessllvmInternal", file: !20, line: 23, baseType: !21, size: 32, elements: !22, identifier: "_ZTS17chessllvmInternal")
!20 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/data/aie_ml/lib/isg/me_chess_llvm.h", directory: "")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !{!23}
!23 = !DIEnumerator(name: "chessllvm_reinterpret", value: 0, isUnsigned: true)
!24 = !{!25, !71, !72, !73, !74, !96}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "T", scope: !28, file: !27, line: 903, baseType: !65)
!27 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/include/adf/window/window.h", directory: "")
!28 = distinct !DISubprogram(name: "window_readincr<(aie_dm_resource)0>", linkageName: "_ZL15window_readincrIL15aie_dm_resource0EEvP12input_windowIfERf", scope: !27, file: !27, line: 903, type: !29, scopeLine: 903, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, templateParams: !63, retainedNodes: !60)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !59}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_window_float", file: !27, line: 83, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_window<float>", file: !27, line: 38, size: 416, flags: DIFlagTypePassByValue, elements: !34, templateParams: !56, identifier: "_ZTS12input_windowIfE")
!34 = !{!35, !36, !37, !45, !46, !50, !51, !52, !53, !54}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !33, file: !27, line: 40, baseType: !21, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !33, file: !27, line: 41, baseType: !21, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !33, file: !27, line: 42, baseType: !38, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "window_datatype", file: !41, line: 8, baseType: !42)
!41 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/include/adf/window/window_internal.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !43, line: 24, baseType: !44)
!43 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/data/aie_ml/lib/runtime/include/stdint.h", directory: "")
!44 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !33, file: !27, line: 43, baseType: !38, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !33, file: !27, line: 44, baseType: !47, size: 64, offset: 128)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !33, file: !27, line: 45, baseType: !38, size: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !33, file: !27, line: 46, baseType: !47, size: 64, offset: 224)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !27, line: 47, baseType: !21, size: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !33, file: !27, line: 48, baseType: !21, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !33, file: !27, line: 52, baseType: !55, size: 64, offset: 352)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !48)
!56 = !{!57}
!57 = !DITemplateTypeParameter(name: "T", type: !58)
!58 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!59 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !58, size: 32)
!60 = !{!61, !62}
!61 = !DILocalVariable(name: "w", arg: 1, scope: !28, file: !27, line: 903, type: !31)
!62 = !DILocalVariable(name: "value", arg: 2, scope: !28, file: !27, line: 903, type: !59)
!63 = !{!64}
!64 = !DITemplateValueParameter(name: "Resource", type: !3, value: i32 0)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "aie_dm_resource_set_t<float, (aie_dm_resource)0>", file: !66, line: 235, baseType: !67)
!66 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/data/aie_ml/lib/aie_core.h", directory: "")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !68, file: !66, line: 219, baseType: !58)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aie_dm_resource_set<float, (aie_dm_resource)0>", file: !66, line: 217, size: 8, flags: DIFlagTypePassByValue, elements: !69, templateParams: !70, identifier: "_ZTS19aie_dm_resource_setIfL15aie_dm_resource0EE")
!69 = !{}
!70 = !{!57, !64}
!71 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "T", scope: !76, file: !27, line: 903, baseType: !65)
!76 = distinct !DISubprogram(name: "window_writeincr<(aie_dm_resource)0>", linkageName: "_ZL16window_writeincrIL15aie_dm_resource0EEvP13output_windowIfEf", scope: !27, file: !27, line: 903, type: !77, scopeLine: 903, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, templateParams: !63, retainedNodes: !93)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !79, !58}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_window_float", file: !27, line: 93, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "output_window<float>", file: !27, line: 57, size: 416, flags: DIFlagTypePassByValue, elements: !82, templateParams: !56, identifier: "_ZTS13output_windowIfE")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !81, file: !27, line: 59, baseType: !21, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !81, file: !27, line: 60, baseType: !21, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !81, file: !27, line: 61, baseType: !38, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !27, line: 62, baseType: !38, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !81, file: !27, line: 63, baseType: !47, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !81, file: !27, line: 64, baseType: !38, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !81, file: !27, line: 65, baseType: !47, size: 64, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !27, line: 66, baseType: !21, size: 32, offset: 288)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !81, file: !27, line: 67, baseType: !21, size: 32, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !81, file: !27, line: 71, baseType: !55, size: 64, offset: 352)
!93 = !{!94, !95}
!94 = !DILocalVariable(name: "w", arg: 1, scope: !76, file: !27, line: 903, type: !79)
!95 = !DILocalVariable(name: "value", arg: 2, scope: !76, file: !27, line: 903, type: !58)
!96 = !DIBasicType(name: "addr_t", size: 32, encoding: DW_ATE_unsigned)
!97 = !{!98, !104, !106, !110, !112, !115, !117, !120, !123, !126, !128, !131, !133, !135, !137, !139, !141, !143, !145, !147, !149, !151, !153, !155, !157, !159, !161, !163, !165, !167, !169, !171, !173, !182, !186, !196, !200, !202, !204, !208, !212, !216, !218, !222, !227, !231, !235, !239, !241, !243, !245, !247, !249, !253}
!98 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !101, file: !103, line: 57)
!99 = !DINamespace(name: "__2", scope: !100, exportSymbols: true)
!100 = !DINamespace(name: "std", scope: null)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !102, line: 35, baseType: !5)
!102 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/tps/lnx64/target_aie_ml/bin/LNa64bin/../../chessdir/clangdir/16/include/stddef.h", directory: "")
!103 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/data/aie_ml/lib/runtime_cxx/libs/libcxx-9.0.0/include-lite/../include/cstddef", directory: "")
!104 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !105, file: !103, line: 58)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !21)
!106 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !107, file: !103, line: 63)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !108, line: 24, baseType: !109)
!108 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/tps/lnx64/target_aie_ml/bin/LNa64bin/../../chessdir/clangdir/16/include/__stddef_max_align_t.h", directory: "")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 19, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS11max_align_t")
!110 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !42, file: !111, line: 161)
!111 = !DIFile(filename: "/tools/Xilinx/Vitis/2024.2/aietools/data/aie_ml/lib/runtime_cxx/libs/libcxx-9.0.0/include-lite/../include/cstdint", directory: "")
!112 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !113, file: !111, line: 163)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !43, line: 25, baseType: !114)
!114 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!115 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !116, file: !111, line: 164)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !43, line: 26, baseType: !5)
!117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !118, file: !111, line: 166)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !43, line: 27, baseType: !119)
!119 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!120 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !121, file: !111, line: 170)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 29, baseType: !122)
!122 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!123 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !124, file: !111, line: 172)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !43, line: 30, baseType: !125)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !127, file: !111, line: 173)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 31, baseType: !21)
!128 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !129, file: !111, line: 175)
